## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (9 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "REDIS"
                                property = "data.REDIS_PASSWORD"
                            }
                            secretKey = "REDIS_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "SOPS"
                              + property = "data.SOPS"
                            }
                          + secretKey = "SOPS"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (9 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "REDIS"
                                metadataPolicy     = "None"
                                property           = "data.REDIS_PASSWORD"
                                version            = null
                            }
                            secretKey = "REDIS_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SOPS"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SOPS"
                              + version            = (known after apply)
                            }
                          + secretKey = "SOPS"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

#########################################################
##
##   Planning changes for stg environment...
##
#########################################################

#########################################################
##
##   Planning changes for prod environment...
##
#########################################################

#########################################################
##
##   Planning changes for sandbox environment...
##
#########################################################

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (9 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "REDIS"
                                property = "data.REDIS_PASSWORD"
                            }
                            secretKey = "REDIS_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "SOPS"
                              + property = "data.SOPS"
                            }
                          + secretKey = "SOPS"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (9 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "REDIS"
                                metadataPolicy     = "None"
                                property           = "data.REDIS_PASSWORD"
                                version            = null
                            }
                            secretKey = "REDIS_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SOPS"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SOPS"
                              + version            = (known after apply)
                            }
                          + secretKey = "SOPS"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.fluent[0].module.helm.helm_release.this will be updated in-place
  ~ resource "helm_release" "this" {
        id                         = "fluent"
      ~ metadata                   = [
          - {
              - app_version    = "3.2.8"
              - chart          = "fluent-bit"
              - first_deployed = 1742557965
              - last_deployed  = 1742594261
              - name           = "fluent"
              - namespace      = "default"
              - notes          = <<-EOT
                    Get Fluent Bit build information by running these commands:
                    
                    export POD_NAME=$(kubectl get pods --namespace default -l "app.kubernetes.io/name=fluent-bit,app.kubernetes.io/instance=fluent" -o jsonpath="{.items[0].metadata.name}")
                    kubectl --namespace default port-forward $POD_NAME 2020:2020
                    curl http://127.0.0.1:2020
                EOT
              - revision       = 8
              - values         = jsonencode(
                    {
                      - config     = {
                          - filters = <<-EOT
                                [FILTER]
                                    Name                kubernetes
                                    Match               kube.*
                                    Kube_URL            https://kubernetes.default.svc:443
                                    Kube_CA_File        /var/run/secrets/kubernetes.io/serviceaccount/ca.crt
                                    Kube_Token_File     /var/run/secrets/kubernetes.io/serviceaccount/token
                                    Kube_Tag_Prefix     kube.var.log.containers.
                                    Merge_Log           On
                                    Merge_Log_Key       log_processed
                                    K8S-Logging.Parser  On
                                    K8S-Logging.Exclude Off
                                    
                                [FILTER]
                                    Name                record_modifier
                                    Match               *
                                    Record              log_format structured
                                    
                                [FILTER]
                                    Name                lua
                                    Match               kube.var.log.containers.trace-demo*
                                    Script              /fluent-bit/scripts/extract_trace_id.lua
                                    Call                extract_trace_id
                                
                                [FILTER]
                                    Name                lua
                                    Match               kube.*
                                    Script              /fluent-bit/scripts/filter_health_checks.lua
                                    Call                filter_health_checks
                            EOT
                          - inputs  = <<-EOT
                                [INPUT]
                                    Name              tail
                                    Tag               kube.*
                                    Path              /var/log/containers/*.log
                                    Parser            docker
                                    DB                /var/log/flb_kube.db
                                    Mem_Buf_Limit     5MB
                                    Skip_Long_Lines   On
                                    Refresh_Interval  10
                            EOT
                          - outputs = <<-EOT
                                [OUTPUT]
                                    Name                   loki
                                    Match                  *
                                    Host                   loki.fullstack.pw
                                    Port                   443
                                    TLS                    On
                                    Labels                 job=fluentbit,cluster=tools
                                    Label_Keys             $kubernetes['namespace_name'],$kubernetes['pod_name'],$kubernetes['container_name'],$kubernetes['labels']['app']
                                    Remove_Keys            stream
                                    Auto_Kubernetes_Labels On
                                    Line_Format            json
                            EOT
                        }
                      - luaScripts = {
                          - "extract_trace_id.lua"     = <<-EOT
                                function extract_trace_id(tag, timestamp, record)
                                    local log = record["log"]
                                    
                                    if type(log) == "string" then
                                        -- Try to extract trace ID using pattern matching
                                        local _, _, trace_id = string.find(log, "TraceID=([0-9a-f]+)")
                                        
                                        if trace_id then
                                            -- Add the trace ID as a new field
                                            record["trace_id"] = trace_id
                                        end
                                    end
                                    
                                    return 1, timestamp, record
                                end
                            EOT
                          - "filter_health_checks.lua" = <<-EOT
                                function filter_health_checks(tag, timestamp, record)
                                    local log = record["log"]
                                    
                                    if log ~= nil and string.match(string.lower(log), "health check") then
                                        return -1, timestamp, record
                                    end
                                    
                                    return 2, timestamp, record
                                end
                            EOT
                        }
                    }
                )
              - version        = "0.48.9"
            },
        ] -> (known after apply)
        name                       = "fluent"
      ~ values                     = [
          ~ <<-EOT
                luaScripts:
                    extract_trace_id.lua: |
                        function extract_trace_id(tag, timestamp, record)
                            local log = record["log"]
                            
                            if type(log) == "string" then
                                -- Try to extract trace ID using pattern matching
                                local _, _, trace_id = string.find(log, "TraceID=([0-9a-f]+)")
                                
                                if trace_id then
                                    -- Add the trace ID as a new field
                                    record["trace_id"] = trace_id
                                end
                            end
                            
                            return 1, timestamp, record
                        end
                    filter_health_checks.lua: |
                        function filter_health_checks(tag, timestamp, record)
                            local log = record["log"]
                            
                            if log ~= nil and string.match(string.lower(log), "health check") then
                                return -1, timestamp, record
                            end
                            
                            return 2, timestamp, record
                        end
                config:
                  inputs: |
                    [INPUT]
                        Name              tail
                        Tag               kube.*
                        Path              /var/log/containers/*.log
                        Parser            docker
                        DB                /var/log/flb_kube.db
                        Mem_Buf_Limit     5MB
                        Skip_Long_Lines   On
                        Refresh_Interval  10
                
                  filters: |
                    [FILTER]
                        Name                kubernetes
                        Match               kube.*
                        Kube_URL            https://kubernetes.default.svc:443
                        Kube_CA_File        /var/run/secrets/kubernetes.io/serviceaccount/ca.crt
                        Kube_Token_File     /var/run/secrets/kubernetes.io/serviceaccount/token
                        Kube_Tag_Prefix     kube.var.log.containers.
                        Merge_Log           On
                        Merge_Log_Key       log_processed
                        K8S-Logging.Parser  On
                        K8S-Logging.Exclude Off
                        
                    [FILTER]
                        Name                record_modifier
                        Match               *
                        Record              log_format structured
                        
                    [FILTER]
                        Name                lua
                        Match               kube.var.log.containers.trace-demo*
                        Script              /fluent-bit/scripts/extract_trace_id.lua
                        Call                extract_trace_id
                
                    [FILTER]
                        Name                lua
                        Match               kube.*
                        Script              /fluent-bit/scripts/filter_health_checks.lua
                        Call                filter_health_checks
                
                  outputs: |
                    [OUTPUT]
                        Name                   loki
                        Match                  *
                        Host                   loki.fullstack.pw
                        Port                   443
                        TLS                    On
                        Labels                 job=fluentbit,cluster=tools
              -         Label_Keys             $kubernetes['namespace_name'],$kubernetes['pod_name'],$kubernetes['container_name'],$kubernetes['labels']['app']
              +         Label_Keys             $kubernetes['namespace_name'],$kubernetes['pod_name'],$kubernetes['container_name'],$kubernetes['labels']['app'],$trace_id
                        Remove_Keys            stream
                        Auto_Kubernetes_Labels On
                        Line_Format            json
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  